# Pandas Overview

* Data analysis package for use with Python
* Data structures are the fundamental elements
 * 1D - Series
 * 2D - DataFrame
* Easy to work with labeled (or relational) data in SQL tables or Excel spreadsheets
* Documentation: http://pandas.pydata.org/pandas-docs/version/0.19.1/

# Import the Pandas Package

In [21]:
import pandas as pd

# Import and Preview Data from File

In [46]:
df = pd.read_csv("data1.csv", header=None)     #import csv file

In [47]:
df.head()                         #view top 5 lines

        0         1
0    Name  Birthday
1    Matt    14-Feb
2   Sammy    23-Apr
3    Ravi    24-Aug
4  Donald    12-May

In [48]:
df.tail(1)                        #view last line

      0       1
10  Tom  30-Aug

# Data Structure Indexing

In [49]:
df[0]

0        Name
1        Matt
2       Sammy
3        Ravi
4      Donald
5     Bridget
6       Brett
7         Pam
8         Jon
9         Max
10        Tom
Name: 0, dtype: object

In [50]:
df.columns = ["Name", "Birthday"]

In [51]:
df.head()

     Name  Birthday
0    Name  Birthday
1    Matt    14-Feb
2   Sammy    23-Apr
3    Ravi    24-Aug
4  Donald    12-May

In [52]:
df['Name']

0        Name
1        Matt
2       Sammy
3        Ravi
4      Donald
5     Bridget
6       Brett
7         Pam
8         Jon
9         Max
10        Tom
Name: Name, dtype: object